## Plan Result (sandbox-enterprise)




<pre><code>Plan: 24 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.subscription[&#34;DTS-RBAC-NONPRODUCTION&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-RBAC-SBOX&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test3&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Dev-Test4&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.subscription[&#34;DTS-Terraform-Prod-Test1&#34;].azurerm_role_assignment.local_role_assignments[&#34;Application Gateway Backend Health Reader&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;CFT-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Crime&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;HMCTS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Heritage-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Platform-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-NonProd&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-Prod&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;SDS-Sandbox&#34;]
  * module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader[&#34;Security&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.subscription["DTS-RBAC-NONPRODUCTION"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8ab6be86-c5cb-4a62-a6cb-ffa01275e938"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/06069648-d13b-4c3c-9367-f3a1ed8e38bc"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-RBAC-SBOX"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e32d2e6a-996f-4a46-a2ee-af158599f412"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/efd1f812-596d-4175-9e19-5b0577156ff9"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test3"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b8f2c838-3211-49ed-93ce-a0451d793055"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/6d1e076a-5d02-4920-9fba-04063e28a488"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Dev-Test4"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3fe70e12-a506-450c-9c80-a33bf2bca983"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/173a0e96-4482-4859-ac93-79e4abc83ab0"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.subscription["DTS-Terraform-Prod-Test1"].azurerm_role_assignment.local_role_assignments["Application Gateway Backend Health Reader"] will be created
  + resource "azurerm_role_assignment" "local_role_assignments" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "0c6e5e34-37c7-4ca7-98a1-4b4ada527aa5"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/subscriptions/bb9ca405-3217-4c84-9780-cdfab539e8b3"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "395176e5-5a98-44cd-ac3f-e7fddea7045b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e7f4b574-726a-4691-808c-6719fd213fd6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e1b9e35d-ae46-49b1-9340-cb5f9e66fec4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["CFT-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e55cb6f0-cf4f-4274-931f-7ca58abd38f4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/CFT-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Crime"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "52494b53-d7b2-4f26-95bd-ca321872567c"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Crime"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["HMCTS"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bdd5cbe3-bdf5-495c-a0c9-09c558347052"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/HMCTS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "bc21998b-1eb1-415b-8310-8204c766be99"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "37022189-9033-4f5a-a79c-6df1614e2861"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7d2c4772-53f2-4668-901a-bb8d442030f4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Heritage-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "69df29f6-f4b2-4b8a-bbcc-ee2ad47a1307"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Heritage-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "9d6ec479-d64b-4bbb-9a2b-515b00413f55"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c9d754e0-1f12-48f0-b4e5-e0882e250554"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "b9b196b5-4460-406c-a1c0-7712f865dd21"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Platform-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "653ef43a-b805-4499-a89b-0c61557573c6"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Platform-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "49159789-e9b1-49a0-9e04-792f44e42b96"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-NonProd"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "1d9051ee-220f-45c0-a31e-821afea3bad1"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-NonProd"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-Prod"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5c92c325-046f-4cb2-859f-393c3e74fd6f"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Prod"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["SDS-Sandbox"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "cf560909-f909-49f6-8d33-e46e4b63c4f2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/SDS-Sandbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.enterprise.module.bootstrap.azurerm_role_assignment.app_gateway_backend_health_reader["Security"] will be created
  + resource "azurerm_role_assignment" "app_gateway_backend_health_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "e59e090d-660b-42c4-a1a4-76215404f3d0"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Application Gateway Backend Health Reader"
      + scope                            = "/providers/Microsoft.Management/managementGroups/Security"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 24 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":69,"Program":"tfcmt","SHA1":"","Target":"sandbox-enterprise","Vars":{}} -->